#coding=gbk
"""sample 002
#企业发放的奖金根据利润提成
#1.利润低于或等于10万元时，奖金可提10%，利润
#高于10万元，低于20万元时，低于10万元的部分按
#10%提成，高于10万元的部分，可提成7.5%；
#20万元到40万元之间时，高于20万元的部分，可提成
#5%；40万到60万之间时，高于40万元的部分，可
#提成3%；60万元到100万元之间时，高于60万元的
#部分，可提成1.5%，高于100万元时，超过100万的
#部分按1%提成，从键盘输入当月利润，求应发放奖金总数？
"""



income = int( raw_input("What's your income: "))

if income <= 100000:
    bonus = income * 0.1

elif income<=200000:
    bonus = 100000 * 0.1 + (income-100000) * 0.075

elif income<=400000:
    bonus = 100000 * 0.1 + 100000 * 0.075 + (income-200000) * 0.05

elif income<=600000:
    bonus =100000 * 0.1+100000 * 0.075 + 200000 * 0.05 + (income -400000)*0.03

elif income<=1000000:
    bonus = 100000 * 0.1+100000 * 0.075 + 200000 * 0.05 + 200000*0.03 +(income-600000)*0.15

else:
    bonus =100000 * 0.1+100000 * 0.075 + 200000 * 0.05 + 200000*0.03 +400000*0.15+(income-1000000)*0.01

print ("bonus is: ", bonus)
